src/toir_cfe/src/Documents/проф_ПланЗакупок/проф_ПланЗакупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9694b0f7-dc1d-4623-b6ab-c6b1311b0975">
  <name>проф_ПланЗакупок</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="c256b943-dc47-4e61-a852-e5f4ab6458ae">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fe3473bd-fca5-4eca-9d94-e3bd356e1351">
    <name>НачалоПериода</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f49a0cac-d52a-46e8-b164-6a9ab3c8135e">
    <name>ОкончаниеПериода</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="52a6904e-898a-484f-9a1d-bbfce0d54434">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6f9d7c6d-62ea-4cf6-8c3d-9b97792c5621">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="322d0a6a-ed57-4d38-a6dd-96749e7896af">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="24addc22-3257-4b45-b094-3d36fb547f37">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="698b1081-16d8-4f4b-bc89-a8c9f16b7c60">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="caa6a0b1-f566-43ca-93aa-bcf1ad32a3ed">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="598573db-2258-4b24-8230-0811b779ded3">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7c2bbc0b-b610-4dc0-bb60-454390cd7c77">
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="394652ae-48d1-4b11-a57e-eab828eba172">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Documents/проф_ПланЗакупок/ObjectModule.bsl
// ++ Проф-ИТ, #167, Соловьев А.А, 05.10.2023

#Область ОбработчикиСобытий
	
&После("ОбработкаПроведения")
Процедура проф_ОбработкаПроведения(Отказ, РежимПроведения)

	// регистр проф_ПланыЗакупок
	Движения.проф_ПланыЗакупок.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.проф_ПланыЗакупок.Добавить();
		Движение.Период = НачалоПериода; 
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Склад = Склад;   
		Движение.Подразделение = Подразделение;   
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.ЗаданИнтервалПотребности = Истина;
		Движение.ИнтервалПотребностиДо = ОкончаниеПериода;
		Движение.ИнтервалПотребностиОт = НачалоПериода;
	КонецЦикла;

КонецПроцедуры

&После("ПередЗаписью")
Процедура проф_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//++ Проф-ИТ, #401, Соловьев А.А., 11.12.2023
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		проф_ОбщегоНазначенияВызовСервера.ПроверитьПризнакПодразделенияОрганизации(ЭтотОбъект["Подразделение"], Отказ);
	КонецЕсли;
	//-- Проф-ИТ, #401, Соловьев А.А., 11.12.2023
	
КонецПроцедуры

#КонецОбласти

// -- Проф-ИТ, #167, Соловьев А.А, 05.10.2023
